БухЭксп/InformationRegisters/CW_ДоступностьСтатусовПоГруппамПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступностьСтатусовПоГруппамПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ВладельцыСтатуса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_НазначенияСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НазначенияСтатусов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВлияетНаПроведениеДокументаВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_СтатусыДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_НазначенияСтатусов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьПоБухгалтерскомуУчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначатьДляНовыхОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРассчитыватьСтатистикуДляПоследнего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_СтатусыДокументовСервер/Ext/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	ИспользуютсяСтатусыДокументов 		= ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов");
	Если Не ИспользуютсяСтатусыДокументов Тогда
		Возврат;
	КонецЕсли;

	ОбъектИспользуетсяВСистемеСтатусов 			= Справочники.CW_НазначенияСтатусов.ОбъектИспользуетсяВСистемеСтатусов(ТипЗнч(Объект.Ссылка));
	Элементы.ГруппаСтатусДокумента.Видимость 	= ОбъектИспользуетсяВСистемеСтатусов;
	
	Если Не ОбъектИспользуетсяВСистемеСтатусов Тогда
		Возврат;
	КонецЕсли;  
	
	РедактированиеСтатусовДокументов = CW_ПраваДоступа.ПравоДоступно("РедактированиеСтатусовДокументов");
	Элементы.ГруппаСтатусДокумента.Доступность = РедактированиеСтатусовДокументов;
	
	МассивДоступныеСтатусы = ПолучитьСписокДоступныхСтатусовДокумента(Объект.Ссылка);
	
	ЗаполнитьСписокВыбораСтатусовДокумента(Форма, МассивДоступныеСтатусы);
	
	ДанныеСтатуса = ПолучитьДанныеСтатусаДокумента(Объект.Ссылка);
	
	Если Объект.Ссылка.Пустая() Тогда
		СтатусНовогоДокумента = Справочники.CW_СтатусыДокументов.ПолучитьСтатусНовогоОбъекта(Объект.Ссылка.Метаданные().ПолноеИмя());
		ДанныеСтатуса.Вставить("СтатусДокумента",СтатусНовогоДокумента); 
		Форма.СтатусДокументаЗаписатьИзменения = истина;           
	КонецЕсли;
	
	УстановитьДанныеСтатусаДокумента(Форма, ДанныеСтатуса);  
	
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт 
	
	Объект 	 = Форма.Объект;
	
	ИспользуютсяСтатусыДокументов 		= ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов");
	Если ИспользуютсяСтатусыДокументов Тогда
		
		ОбъектИспользуетсяВСистемеСтатусов = Справочники.CW_НазначенияСтатусов.ОбъектИспользуетсяВСистемеСтатусов(ТипЗнч(Объект.Ссылка));
		Если ОбъектИспользуетсяВСистемеСтатусов Тогда
			ТекущийОбъект.ДополнительныеСвойства.Вставить("СтатусДокумента", Форма.СтатусДокумента);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


Процедура ФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;
	
	ИспользуютсяСтатусыДокументов 		= ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов");
	ОбъектИспользуетсяВСистемеСтатусов 	= Справочники.CW_НазначенияСтатусов.ОбъектИспользуетсяВСистемеСтатусов(Форма.Список.ОсновнаяТаблица);
	
	Элементы.СтатусДокумента.Видимость 	= ИспользуютсяСтатусыДокументов и ОбъектИспользуетсяВСистемеСтатусов;
	
КонецПроцедуры

Функция ПолучитьСписокДоступныхСтатусовДокумента(Ссылка)

	ГруппаПользователя	= CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	ПолныеПрава			= CW_ПраваДоступа.ЭтоПолноправныйПользователь() или ГруппаПользователя.ПолныеПрава ИЛИ ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	
	ИмяОбъектаМетаданных 	= ПолучитьИмяОбъектаМетаданных(Ссылка);
	МассивДоступныеСтатусы 	= Справочники.CW_СтатусыДокументов.СтатусыОбъектаМетаданных(ИмяОбъектаМетаданных);

	Если Не ПолныеПрава Тогда

		УстановитьПривилегированныйРежим(Истина);
		МассивДоступныеСтатусы  = РегистрыСведений.CW_ДоступностьСтатусовПоГруппамПользователей.ПолучитьМассиивДоступныхСтатусовГруппыПользователя(ГруппаПользователя, МассивДоступныеСтатусы);
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 
	
	Возврат МассивДоступныеСтатусы;
	
КонецФункции

Процедура ЗаполнитьСписокВыбораСтатусовДокумента(Форма, МассивДоступныеСтатусы)
	
	Для Каждого ЭлементМассива из МассивДоступныеСтатусы Цикл
		Если ЭлементМассива.ПроводитьПоБухгалтерскомуУчету Тогда
			КартинкаСтатуса = БиблиотекаКартинок.ЗеленаяГалка;
		Иначе
			КартинкаСтатуса = БиблиотекаКартинок.Пустая;
		КонецЕсли;
		
		Форма.СтатусДокументаСписокВыбора.Добавить(ЭлементМассива,,,КартинкаСтатуса);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Форма.СтатусДокументаСписокВыбора, Форма.СтатусДокументаАдресСпискаВыбора);
	
КонецПроцедуры

Процедура ПолучитьТекущийСтатусДокумента(Объект, Форма) Экспорт
	
	ДанныеСтатуса = ПолучитьДанныеСтатусаДокумента(Объект.Ссылка);
	Если ДанныеСтатуса.СтатусДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		СтатусНовогоДокумента = Справочники.CW_СтатусыДокументов.ПолучитьСтатусНовогоОбъекта(Объект.Ссылка.Метаданные().ПолноеИмя());
		ДанныеСтатуса.Вставить("СтатусДокумента",СтатусНовогоДокумента );
	КонецЕсли;

	УстановитьДанныеСтатусаДокумента(Форма, ДанныеСтатуса);
	
КонецПроцедуры  

Функция ПолучитьДанныеСтатусаДокумента(Ссылка) Экспорт 
	
	Возврат РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Ссылка);
	
КонецФункции

Процедура УстановитьДанныеСтатусаДокумента(Форма, ДанныеСтатуса)
	
	Форма.СтатусДокумента 				= ДанныеСтатуса.СтатусДокумента;
	Форма.СтатусДокументаКомментарий 	= ДанныеСтатуса.Комментарий;
	Форма.СтатусДокументаПредыдущий 	= ДанныеСтатуса.СтатусДокумента;
	Форма.СтатусДокументаАвтор 			= ДанныеСтатуса.Автор;    

КонецПроцедуры   

Функция ПолучитьИмяОбъектаМетаданных(Ссылка) Экспорт
	
	Возврат Ссылка.Метаданные().ПолноеИмя();
	
КонецФункции

Процедура ЗаписатьСтатусДокумента(ДанныеДляЗаписи) Экспорт
	
	ДанныеДляЗаписи.Вставить("Автор", ПараметрыСеанса.ТекущийПользователь);

	РегистрыСведений.CW_СтатусыДокументов.ДобавитьЗаписьВРегистр(ДанныеДляЗаписи);
	
КонецПроцедуры

Процедура  ОбновитьКомментарийЗаписиСтатуса(ДанныеДляЗаписи)  Экспорт
	
	КлючЗаписи = РегистрыСведений.CW_СтатусыДокументов.ПолучитьКлючПоследнейЗаписи(ДанныеДляЗаписи.Документ);
	Если КлючЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.CW_СтатусыДокументов.ОбновитьКомментарийЗаписиСтатуса(КлючЗаписи, ДанныеДляЗаписи.Комментарий);
	
КонецПроцедуры
	
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт 
	
	Объект 	 = Форма.Объект;
	
	ИспользуютсяСтатусыДокументов 		= ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов");
	Если Не ИспользуютсяСтатусыДокументов Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.СтатусДокументаЗаписатьИзменения Тогда 

		СтатусДокумента = Неопределено;
		ТекущийОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента", СтатусДокумента);
		
		Если ЗначениеЗаполнено(СтатусДокумента) Тогда
			//Запишем первый и текущий статус
			ДанныеДляЗаписи = Новый Структура;
			ДанныеДляЗаписи.Вставить("Документ", 		Форма.Объект.Ссылка);
			ДанныеДляЗаписи.Вставить("СтатусДокумента", СтатусДокумента);
			ДанныеДляЗаписи.Вставить("Комментарий", 	Форма.СтатусДокументаКомментарий);
			
			ЗаписатьСтатусДокумента(ДанныеДляЗаписи);
		КонецЕсли; 
		
		ДанныеСтатуса = ПолучитьДанныеСтатусаДокумента(Форма.Объект.Ссылка);
		УстановитьДанныеСтатусаДокумента(Форма, ДанныеСтатуса);
		
		Форма.СтатусДокументаЗаписатьИзменения = Ложь;
		
	Конецесли;
	
КонецПроцедуры

Функция ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов") Тогда
		 Возврат Истина;
	КонецЕсли;
	
	Если Не Справочники.CW_НазначенияСтатусов.ОбъектИспользуетсяВСистемеСтатусов(ТипЗнч(Ссылка)) Тогда
		 Возврат Истина;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтатусДокумента) Тогда
		 Возврат Истина;
	КонецЕсли;
	
	НазначениеСтатуса = СтатусДокумента.Владелец;
	Если НЕ Справочники.CW_НазначенияСтатусов.НазначениеСтатусаПрименимоКОбъекту(НазначениеСтатуса, ТипЗнч(Ссылка)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не НазначениеСтатуса.ВлияетНаПроведениеДокументаВБухгалтерскомУчете Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат СтатусДокумента.ПроводитьПоБухгалтерскомуУчету;
	
КонецФункции        

Функция ТребуетсяЗаписьДокумента(Ссылка, ПредыдущийСтатус, ТекущийСтатус) Экспорт    
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Ссылка)) тогда
		Возврат ложь;
	КонецЕсли;  
	
	Если Ссылка.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить тогда
		Возврат Ложь;
	КонецЕсли;
	
	мТипыДокументов = ТипыДокументовНеПодлежащиеПроводениюПоБухгалтескомуУчету();
	Если мТипыДокументов.Найти(ТипЗнч(Ссылка)) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Ссылка.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Ссылка.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета  = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Ссылка.Дата);

	ЗаписатьДокумент = Ссылка.Проведен И ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет;
	Если ПредыдущийСтатус <> Неопределено Тогда
		ЗаписатьДокумент = ПредыдущийСтатус.ПроводитьПоБухгалтерскомуУчету <> ТекущийСтатус.ПроводитьПоБухгалтерскомуУчету;	
	КонецЕсли;
	
	Возврат ЗаписатьДокумент; 
	
КонецФункции

Функция ТипыДокументовНеПодлежащиеПроводениюПоБухгалтескомуУчету()
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.CW_ОтчетЭкспедитора"));
	Массив.Добавить(Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам"));
	Массив.Добавить(Тип("СправочникСсылка.CW_ПриложенияКДоговорам"));
	
	Возврат Массив;
	
КонецФункции


//Групповая устанвока статусов
Процедура ГрупповаяУстановкаСтатусовОбъектов(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	РезультатВыбора = ПараметрыПроцедуры.РезультатВыбора;
	МассивСсылок    = ПараметрыПроцедуры.МассивСсылок;
	
	ДатаУстановкиСтатуса = ТекущаяДата();
	
	СоответствиеСтатусыДокументов = ПолучитьСтатусыДокументов(МассивСсылок, ДатаУстановкиСтатуса);

	мДокументыКПроведению = Новый Массив;
	
	Для Каждого СсылкаНаОбъект из МассивСсылок Цикл
		
		Если СсылкаНаОбъект.ПометкаУдаления Тогда
			//Пропускаем помеченные документы
			Продолжить;
		КонецЕсли;
		
		ТекущийСтатус = СоответствиеСтатусыДокументов.Получить(СсылкаНаОбъект);
		
		Если ТекущийСтатус = РезультатВыбора.СтатусДокумента Тогда
			//Ничего делать не нужно!
			Продолжить;
		КонецЕсли;
		
		ТребуетсяЗаписьДокумента = CW_СтатусыДокументовСервер.ТребуетсяЗаписьДокумента(СсылкаНаОбъект, ТекущийСтатус, РезультатВыбора.СтатусДокумента);
		
		ДанныеДляЗаписи = Новый Структура;
		ДанныеДляЗаписи.Вставить("Документ", 		СсылкаНаОбъект);
		ДанныеДляЗаписи.Вставить("СтатусДокумента", РезультатВыбора.СтатусДокумента);
		ДанныеДляЗаписи.Вставить("Комментарий", 	РезультатВыбора.Комментарий);
		ДанныеДляЗаписи.Вставить("Период", 			ДатаУстановкиСтатуса);
		
		CW_СтатусыДокументовСервер.ЗаписатьСтатусДокумента(ДанныеДляЗаписи);
		
		Если ТребуетсяЗаписьДокумента Тогда
			мДокументыКПроведению.Добавить(СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СсылкаНаДокумент из мДокументыКПроведению ЦИкл
		ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
		
		тРежимЗаписиДокумента = РежимЗаписиДокумента.Запись;
		Если СсылкаНаДокумент.Проведен Тогда
			тРежимЗаписиДокумента = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
		
		ДокументОбъект.Записать(тРежимЗаписиДокумента);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтатусыДокументов(МассивДокументов, ДатаСреза)
	
	Результат = Новый Соответствие;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыДокументов.Документ КАК Документ,
	               |	СтатусыДокументов.СтатусДокумента КАК СтатусДокумента
	               |ИЗ
	               |	РегистрСведений.CW_СтатусыДокументов.СрезПоследних(&ДатаСреза, Документ В (&МассивДокументов)) КАК СтатусыДокументов";
	
	Запрос.УстановитьПараметр("МассивДокументов", 	МассивДокументов);
	Запрос.УстановитьПараметр("ДатаСреза", 			ДатаСреза);
	
	РезультатЗапрса = Запрос.Выполнить();
	
	Выборка = РезультатЗапрса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Документ, Выборка.СтатусДокумента);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
//Групповая устанвока статусов
